app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    if params[:song_id]
      @songs = Artist.find(params[:song_id]).songs
    else
      @artists = Artist.all