app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found"
      else
      @songs = @artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."artist_id" = ? LIMIT ?  [["artist_id", "100"], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def edit
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]